app/Models/FileModel.php

SELECT `files`.*, `landings`.`id_file`, `landings`.`landing_status`
FROM `files`
INNER JOIN `landings` ON `files`.`id` = `landings`.`id_file`
WHERE `files`.`file_type` = 'USER'
AND `files`.`file_status` = 'ACTV'
AND `landings`.`landing_status` = 'ACTV'
---
    public function getFileForUser() {
        return $this->select('files.*, landings.id_file, landings.landing_status')
                    ->join('landings', 'files.id = landings.id_file', 'inner')
                    ->where('files.file_type', 'USER')
                    ->where('files.file_status', 'ACTV')
                    ->where('landings.landing_status', 'ACTV')
                    ->get()
                    ->getResult(); // Using `getResult()` instead of `result()`

SELECT *
FROM `files`
WHERE `file_type` = 'GNRL'
AND `file_status` = 'ACTV'
 LIMIT 1
---
    public function getFileForGeneral() {
        return $this->where('file_type', 'GNRL')
                    ->where('file_status', 'ACTV')
                    ->first(); // Using `first()` instead of `row()`