app/Models/UserModel.php

    public function getUser($publisher_id) {
        return $this->where('id', $publisher_id)->first(); // Using 'first()' instead of 'row()' in CI4
---
SELECT *
FROM `users`
WHERE `id` = '12'
 LIMIT 1